/*
                                                      Задача:
                       Створити свою колекцію для збереження та відображення списку контактів
                                            (наприклад, як у телефоні)

                                                     Критерії:
                                    Має бути реалізований наступний функціонал:

- Повинне бути угруповання за абеткою
- Має бути вибір залежно від культури (CultureInfo)
- Підтримувати алфавіт як мінімум 2 мов:
    ○ англійська
    ○ українська
- Якщо ж потрібної культури немає, то вибирати англійську за умовчуванням
- Якщо ж є символи, які не потрапляють у поточний вибраний алфавіт, то додавати їх до розділу "#"
- Якщо контакт починається на цифру, то кидати в "0-9"

- Бонус: Значення для алфавіту повинні бути конфігуровані на підставі якоїсь із
    властивостей об'єкта, який ми хочемо зберігати (наприклад, зчитування CultureInfo з json файлу)

 */

namespace PhoneContactProject
{
    public class Program
    {
        public static void Main(string[] args)
        {
            try
            {
                Starter.Run();
            }
            catch (Exception ex)
            {
                Console.WriteLine($"Exception. {ex.Message}");
            }

            Console.Write("\nPress any key to continue . . .");
            Console.ReadKey();
        }
    }
}